from bocchi.configs.path_config import TEMP_PATH

# SIGN_TODAY_CARD_PATH = IMAGE_PATH / "sign" / "today_card"
SIGN_TODAY_CARD_PATH = TEMP_PATH /"sign"

lik2relation = {
    "0": "路人",
    "1": "陌生",
    "2": "初识",
    "3": "普通",
    "4": "熟悉",
    "5": "信赖",
    "6": "相知",
    "7": "厚谊",
    "8": "亲密",
}

level2attitude = {
    "0": "路人",
    "1": "陌生",
    "2": "初识",
    "3": "普通",
    "4": "熟悉",
    "5": "信赖",
    "6": "相知",
    "7": "厚谊",
    "8": "亲密",
    # "0": "排斥",   # 基本没有好感，还保持距离
    # "1": "陌生",     # 愿意聊，但不深入
    # "2": "可以交流",     # 普通同学/同事，不亲不疏
    # "3": "值得信赖",     # 觉得对方靠谱，可以依靠
    # "4": "普通朋友",         # 关系亲近，愿意主动接触
    # "5": "好朋友",       # 有一定的信任感和默契
    # "6": "亲密朋友",     # 能分享心事、小秘密
    # "7": "喜欢",     # 好感上升，有暧昧/喜欢的感觉
    # "8": "恋人",    # 最亲密的关系
    # "9": "灵魂共鸣"
}


weekdays = {1: "Mon", 2: "Tue", 3: "Wed", 4: "Thu", 5: "Fri", 6: "Sat", 7: "Sun"}

lik2level = {
    5120: "8",
    2560: "7",
    1280: "6",
    640: "5",
    320: "4",
    160: "3",
    80: "2",
    40: "1",
    0: "0",
}